---
kind: other
id: Properties.T:Autodesk.Revit.DB.Lighting.PointLightShape
source: html/e9410b99-8506-07ac-c3de-c4212761f9d7.htm
---
# PointLightShape Properties

Specifies whether the .NET object represents a valid Revit entity.